{
  "_formal_spec": "specs/zpp/TokenizerConfig.zpp",
  "_spec_version": "1.0.0",
  "_description": "Special tokens mapping for Echo-JNN cognitive state tokenizer",
  
  "pad_token": {
    "content": "<pad>",
    "token_id": 0,
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false
  },
  
  "bos_token": {
    "content": "<bos>",
    "token_id": 1,
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false
  },
  
  "eos_token": {
    "content": "<eos>",
    "token_id": 2,
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false
  },
  
  "unk_token": {
    "content": "<unk>",
    "token_id": 3,
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false
  },
  
  "sep_token": {
    "content": "<sep>",
    "token_id": 4,
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "description": "Separator between cognitive streams"
  },
  
  "mask_token": {
    "content": "<mask>",
    "token_id": 5,
    "single_word": false,
    "lstrip": true,
    "rstrip": false,
    "normalized": false,
    "description": "Mask token for masked prediction tasks"
  },
  
  "stream_tokens": {
    "stream_1": {
      "content": "<stream_1>",
      "token_id": 100,
      "description": "Marker for cognitive stream 1 (phase 0°)"
    },
    "stream_2": {
      "content": "<stream_2>",
      "token_id": 101,
      "description": "Marker for cognitive stream 2 (phase 120°)"
    },
    "stream_3": {
      "content": "<stream_3>",
      "token_id": 102,
      "description": "Marker for cognitive stream 3 (phase 240°)"
    }
  },
  
  "mode_tokens": {
    "expressive": {
      "content": "<expressive>",
      "token_id": 200,
      "description": "Expressive mode marker (steps 1-7)",
      "steps": [1, 2, 3, 4, 5, 6, 7]
    },
    "reflective": {
      "content": "<reflective>",
      "token_id": 201,
      "description": "Reflective mode marker (steps 8-12)",
      "steps": [8, 9, 10, 11, 12]
    },
    "pivotal": {
      "content": "<pivotal>",
      "token_id": 202,
      "description": "Pivotal relevance realization marker",
      "steps": [1, 5, 9]
    }
  },
  
  "step_tokens": {
    "step_1": {"content": "<step_1>", "token_id": 300, "mode": "expressive", "type": "pivotal"},
    "step_2": {"content": "<step_2>", "token_id": 301, "mode": "expressive", "type": "affordance"},
    "step_3": {"content": "<step_3>", "token_id": 302, "mode": "expressive", "type": "affordance"},
    "step_4": {"content": "<step_4>", "token_id": 303, "mode": "expressive", "type": "affordance"},
    "step_5": {"content": "<step_5>", "token_id": 304, "mode": "expressive", "type": "pivotal"},
    "step_6": {"content": "<step_6>", "token_id": 305, "mode": "expressive", "type": "affordance"},
    "step_7": {"content": "<step_7>", "token_id": 306, "mode": "expressive", "type": "affordance"},
    "step_8": {"content": "<step_8>", "token_id": 307, "mode": "reflective", "type": "simulation"},
    "step_9": {"content": "<step_9>", "token_id": 308, "mode": "reflective", "type": "pivotal"},
    "step_10": {"content": "<step_10>", "token_id": 309, "mode": "reflective", "type": "simulation"},
    "step_11": {"content": "<step_11>", "token_id": 310, "mode": "reflective", "type": "simulation"},
    "step_12": {"content": "<step_12>", "token_id": 311, "mode": "reflective", "type": "simulation"}
  },
  
  "triad_tokens": {
    "triad_1": {
      "content": "<triad_1>",
      "token_id": 400,
      "steps": [1, 5, 9],
      "description": "Triad 1: Steps {1, 5, 9}"
    },
    "triad_2": {
      "content": "<triad_2>",
      "token_id": 401,
      "steps": [2, 6, 10],
      "description": "Triad 2: Steps {2, 6, 10}"
    },
    "triad_3": {
      "content": "<triad_3>",
      "token_id": 402,
      "steps": [3, 7, 11],
      "description": "Triad 3: Steps {3, 7, 11}"
    },
    "triad_4": {
      "content": "<triad_4>",
      "token_id": 403,
      "steps": [4, 8, 12],
      "description": "Triad 4: Steps {4, 8, 12}"
    }
  },
  
  "nesting_tokens": {
    "nest_1": {
      "content": "<nest_1>",
      "token_id": 500,
      "size": 1,
      "description": "Nest level 1: Global summary (1 term)",
      "a000081_value": 1
    },
    "nest_2": {
      "content": "<nest_2>",
      "token_id": 501,
      "size": 2,
      "description": "Nest level 2: Coarse features (2 terms)",
      "a000081_adjusted": 2
    },
    "nest_3": {
      "content": "<nest_3>",
      "token_id": 502,
      "size": 4,
      "description": "Nest level 3: Medium features (4 terms)",
      "a000081_adjusted": 4
    },
    "nest_4": {
      "content": "<nest_4>",
      "token_id": 503,
      "size": 9,
      "description": "Nest level 4: Fine features (9 terms)",
      "a000081_adjusted": 9
    }
  },
  
  "state_component_tokens": {
    "perception_start": {
      "content": "<perception>",
      "token_id": 600,
      "dimension": 4,
      "description": "Start of perception state (4D)"
    },
    "action_start": {
      "content": "<action>",
      "token_id": 601,
      "dimension": 4,
      "description": "Start of action state (4D)"
    },
    "simulation_start": {
      "content": "<simulation>",
      "token_id": 602,
      "dimension": 9,
      "description": "Start of simulation state (9D)"
    }
  },
  
  "mathematical_markers": {
    "a000081_marker": {
      "content": "<a000081>",
      "token_id": 700,
      "description": "OEIS A000081 sequence marker"
    },
    "twin_primes_marker": {
      "content": "<twin_primes>",
      "token_id": 701,
      "description": "Twin primes (5, 7) marker"
    },
    "triad_of_dyads_marker": {
      "content": "<triad_dyads>",
      "token_id": 702,
      "description": "3×2 triad-of-dyads marker"
    }
  },
  
  "additional_tokens": {
    "cycle_start": {
      "content": "<cycle_start>",
      "token_id": 800,
      "description": "Start of cognitive cycle"
    },
    "cycle_end": {
      "content": "<cycle_end>",
      "token_id": 801,
      "description": "End of cognitive cycle"
    },
    "coherence_high": {
      "content": "<coherence_high>",
      "token_id": 802,
      "description": "High system coherence marker"
    },
    "coherence_low": {
      "content": "<coherence_low>",
      "token_id": 803,
      "description": "Low system coherence marker"
    }
  },
  
  "token_ranges": {
    "special_tokens": [0, 99],
    "stream_markers": [100, 199],
    "mode_markers": [200, 299],
    "step_markers": [300, 399],
    "triad_markers": [400, 499],
    "nesting_markers": [500, 599],
    "state_component_markers": [600, 699],
    "mathematical_markers": [700, 799],
    "additional_markers": [800, 899],
    "reserved": [900, 999],
    "vocabulary": [1000, 31999]
  },
  
  "a000081_alignment": {
    "description": "All token structures align with OEIS A000081 sequence",
    "sequence": [1, 1, 2, 4, 9, 20, 48, 115, 286, 719],
    "nesting_structure": [1, 2, 4, 9],
    "state_dimensions": {
      "perception": 4,
      "action": 4,
      "simulation": 9
    }
  },
  
  "version": "1.0.0"
}
